Revit 2027 API
NumberingSchema.GetAvailableParameters Method
 Get all the available parameters that can be used with numbering.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ISet<NumberingParameter> GetAvailableParameters(
	ElementId category,
	Document document
)
Public Shared Function GetAvailableParameters (
	category As ElementId,
	document As Document
) As ISet(Of NumberingParameter)
public:
static ISet<NumberingParameter^>^ GetAvailableParameters(
	ElementId^ category,
	Document^ document
)
static member GetAvailableParameters :
        category : ElementId *
        document : Document -> ISet<NumberingParameter>
Parameters
category ElementId
 The category for the element that will be numbered.
document Document
 The document where the elements will be numbered.
Return Value
ISet<NumberingParameter>
 The parameters that can be used for numbering in this category and from their associations.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace